# - это комментарий в питоне
print ("hello world")
#**-возведение в степень
#%-деление по модулю
#//-целочисленное деление с отбрасывание дробной части
#/-деление * -умножение + -сложение - -Вычетание
print(23 % 7)
print(23 // 7)
# int() - целочисленный тип данных, целые числа
#""- str() тип данных "строки"
# float, вечещественные числа с плавающей точкой
My_name ="Саша "
My_frend ="Миша"
My_number =13
print(My_name + " " + My_frend)
print(My_name + " 13")
print(My_name + " " + str(My_number))
print(f"{My_name} любимое число {My_number}" )
print(My_name*5) #- репликация(повторение числа или фразы, строки)
#переменная-это область памяти компьютера,которой может храниться одиночное знаение,знак "=" является оператором присваивания и сохраняет значение
color = "Black"
print(color)
